隐私政策<br/><br/>
http://www.warmvoice.cn（简称“本网站”)版权所属暖暖公司（简称“暖暖”或“我们”）。暖暖为您提供“暖暖”即时通讯软件（简称“暖暖”），“暖暖”是一款为移动通信设备提供即时通讯及其他相关服务的应用软件。 依据法律的规定，我们将在特定情形下收集、使用、保存和披露您的个人信息。以下条款描述了我们>如何收集、使用、保存和披露您的个人信息。<br/>
1、个人信息的收集<br/>
1.1 个人信息<br/>
我们使用、保存、使用和披露个人信息是为了通过创建账户、识别用户、回应查询和邮件等方式来为您提供服务。本网站和"暖暖"会向您提供关于通讯>方面的管理和服务、发送新闻、调查、优惠和促销信息以及其他宣传材料以为您提供更好的服务。<br/>
1.2 为实现服务目的而收集<br/>
您无需用户账户即可浏览本网站。如果您想使用本网站更多功能，您必须注册本网站并且于注册页面上提供相关的个人信息。您必须承诺和保证：<br/>
1.2.1 为实现“暖暖”之服务目的，本网站和“暖暖”会通过技术手段收集您的个人信息，通过技术手段所收集的个人信息仅限于您的电话号码、手机通讯录等使用"暖暖"所必需的信息。<br/>
1.2.2 “暖暖”采取多平台异步开发方式，支持Android以及IOS等多类操作系统的使用：<br/>
a.当您使用Android系统时，“暖暖”需要向“暖暖”服务器发送一条激活短信，短信费用与普通短信信息费相同，并由运营商收取。激活之后，您可以免费使用“暖暖”；<br/>
b. 当您使用IOS统时，您需要输入您的真实手机号码进行绑定使用。在您通过各种手机操作系统使用“暖暖”的过程中，“暖暖”所收集的信息仅限于您同意使用“暖暖”基本服务所必需的信息。<br/>
1.2.3 经过您的允许，“暖暖”将分析您的手机通讯录，来帮助您寻找已经在使用“暖暖”的朋友。“暖暖”通过高强度、不可逆的加密算法（将收集到的号码加密成为一系 列不可解密的字符串）来加密您的通讯录信息，并依据改加密后的信息进行好友匹配的操作。<br/>
1.3 用户提供<br/>
1.3.1 如果您需要使用更多暖暖功能，例如将暖暖的内容分享到微博、人人网和开心网等其他网站或完善您的个人信息，以便享受更多的服务或更加便捷的联系好友，您需要完善您的个人名片，如填写您的邮箱、性别、所在地、生日等个人信息。<br/>
1.3.2 您提供的信息，“暖暖”将最大限度尽合理之商业义务进行保密。经过您的同意，“暖暖”将会向您提供新闻、资讯、版本升级等服务。
1.4 “暖暖”软件是用户之间用来发送信息和其他内容的工具。<br/>
如果您将信息或其他内容发送给另一个用户，“暖暖”服务器将会为您保存此信息/内容，并将此信息/内容发送给该用户。<br/>
1.5 您提供信息的其他方式<br/>
我们将采用其他方式（例如：电子邮件、信息下载、购买产品或服务、用户支持、反馈以及调查表）来收集您的个人信息。如果您将个人信息填写在其>他开放的平台上，其他用户可能会获知您的信息。<br/>
1.6 您的其他信息<br/>
为了便于您使用本网站和"暖暖"软件，我们的服务器将会收集关于您的移动通讯设备的信息，例如型号、设备ID、互联网协议地址、您访问的时间和地>点、路由数据包、信息发送人和接收数据（但不是信息本身），以及其他类似的特征记录。我们将使用Cookies和类似统一资源定位器（URL）的导航数据来收集您访问时 间和日期、搜索和查看的信息等。<br/>
2、个人信息的使用<br/>
2.1 除本隐私政策未载明或本隐私政策的更新未能首先通知您的情况下，您的个人信息将不会用于其他目的。<br/>
2.2 匿名汇总统计数据不是"暖暖">所定义的个人用户信息，我们将为多种目的，包括但不限于分析和使用模式的报告等，来保存和使用此类信息。"暖暖"保留以任何目的或单方面许可第三方使用和披露匿名汇总统计数据的权利。<br/>
3、个人信息的披露<br/>
3.1 除非本隐私政策载明的有限披露，我们会妥善保存您的个人信息并不会泄露客户名单。<br/>
3.2 您于此授权，以下情形下，我们将会向第三方披>露您的个人信息而无需通过您的同意：<br/>
3.2.1 如果我们披露这些信息是用来识别、联系或向可能对我们的权利或财产、网站用户或者其他任何人（包括其他任何人 的权利和财产）造成损害之行为提起诉讼之必要；<br/><br/>
3.2.2 法律调查之必要；<br/>
3.2.3 此类披露是法律规定或应向我们送达的传票或其他执法部门发出的令状之必要。<br/>
4、安全<br/>
4.1 对我们来说，个人信息的安全非常重要。我们将尽合理的商业努力保障您的个人信息安全，并实施合理的商业程序限制非授权访问、使用或者披露>您的个人信息。尽管采取上述措施，但是您应当知晓"暖暖"不能完全避免与个人信息相关的安全危险。<br/>
5、您应当协助我们以保护您的个人信息安全。<br/>
例如，不要泄露您的个人密码。<br/>
6、第三方网站<br/>
6.1 当您点击本网站链接的其他网站时，您已经离开我们的网站并访问其他网站，其他网站可能会收集您的个人信息或匿名数据，因此，我们无法控制>、检查或者回应此类网站和网站内容。<br/>
6.2 本隐私政策不适用于在您点击链接后的外部网站收集数据的行为。<br/>
7、对青少年个人信息的收集和使用<br/>
7.1 我们建议18岁以下的未成年人在其法定监护人的许可和指导下使用本网站和“暖暖”。<br/>
7.2 本网站和“暖暖”不会使用未成年人的个人信息，也不会向任何第三方透露可识别的信息，监护人有权拒绝本网站和“暖暖”进一步收集被监护人的个人信息，或要求本网站和“暖暖”删除该被监护人个人信息。<br/>
8、免责声明<br/>
8.1如发生下述情形，本网站及暖暖不承担任何法律责任：<br/>
8.1.1 依据法律规定或相关政府部门的要求提供您的个人信息；<br/>
8.1.2 由于您的使用不当而导致任何个人信息的泄露；<br/>
8.1.3 任何由于黑客攻击，电脑病毒的侵入，非法内容信息、骚扰信息的屏蔽，政府管制以及其他任何网络、技术、通信线路、信息安全管理措施等原因造成的服务中断、受阻等不能满足用户要求的情形；<br/>
8.1.4 用户因第三方如运营商的通讯线路故障、技术问题、网络、电脑故障、系统不稳定及其他因不可抗力造成的损失的情形；<br/>
8.1.5 使用"暖暖"可能存在的来自他人匿名或冒名的含有威胁、诽谤、令人反感或非法内容的信息而招致的风险；<br/>
8.1.6 用户之间通过本网站或"暖暖"与其他用户交往，因受误导或欺骗而导致或可能导致的任何心理、生理上的伤害以及经济上的损失；<br/>
8.1.7 本网站和"暖暖"明文声明，不以明示或默示及以任何形式对本网站和"暖暖"及其合作公司服务之及时性、安全性、准确性做出担保。<br/>
8.2为了保证您的暖暖使用体验，在网络连接不稳定时，我们可能会针对您的网络进行一些检测，该检测仅消耗极少流量（10K以内），每天最多一次，请理解。<br/>
9、本隐私政策的修订<br/>
9.1 本隐私政策容许调整，如果我们对使用您的个人信息方法做出任何实质性调整，我们将通过您提供的电子邮件地址，或通过网站的公告通知您。<br/>
9.2 我们发出的包含此类变更通知的电子邮件毫无疑问的组成上述变更通知的有效部分。如果您不希望我们改变对您个人信息的使用，您必须早于您期望停止使用我们的账户之前通知我们。您继续使用本网站和"暖暖"的行为，将被视为您知晓并同意受通知中此类变更条款的约束。<br/>
